## Staging: network
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
security_groups_lambda.tf
```
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 0 to change, 5 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                             |
|--------|--------------------------------------------------------------|
| add    | `aws_security_group.lambda`                                  |
|        | `aws_vpc_security_group_egress_rule.privatelink`             |
|        | `aws_vpc_security_group_ingress_rule.privatelink`            |
|        | `aws_vpc_security_group_ingress_rule.rds`                    |
|        | `aws_vpc_security_group_ingress_rule.redis`                  |
| delete | `aws_security_group.lambda_nagware`                          |
|        | `aws_security_group_rule.lambda_nagware_egress_internet`     |
|        | `aws_security_group_rule.lambda_nagware_egress_redis`        |
|        | `aws_security_group_rule.privatelink_lambda_nagware_ingress` |
|        | `aws_security_group_rule.redis_ingress_lambda_nagware`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_security_group.lambda will be created
  + resource "aws_security_group" "lambda" {
      + arn                    = (known after apply)
      + description            = "Lambdas"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "lambda"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-0ad5b3739860129d0"
    }

  # aws_security_group.lambda_nagware will be destroyed
  # (because aws_security_group.lambda_nagware is not in configuration)
  - resource "aws_security_group" "lambda_nagware" {
      - arn                    = "arn:aws:ec2:ca-central-1:687401027353:security-group/sg-0d34d30a62da57ade" -> null
      - description            = "Lambda Nagware" -> null
      - egress                 = [] -> null
      - id                     = "sg-0d34d30a62da57ade" -> null
      - ingress                = [] -> null
      - name                   = "lambda_nagware" -> null
      - owner_id               = "687401027353" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - vpc_id                 = "vpc-0ad5b3739860129d0" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_security_group_rule.lambda_nagware_egress_internet will be destroyed
  # (because aws_security_group_rule.lambda_nagware_egress_internet is not in configuration)
  - resource "aws_security_group_rule" "lambda_nagware_egress_internet" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Egress to the internet from Nagware Lambda function" -> null
      - from_port              = 443 -> null
      - id                     = "sgrule-761203303" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-0d34d30a62da57ade" -> null
      - security_group_rule_id = "sgr-0c88cae06f19c9ec3" -> null
      - self                   = false -> null
      - to_port                = 443 -> null
      - type                   = "egress" -> null
    }

  # aws_security_group_rule.lambda_nagware_egress_redis will be destroyed
  # (because aws_security_group_rule.lambda_nagware_egress_redis is not in configuration)
  - resource "aws_security_group_rule" "lambda_nagware_egress_redis" {
      - description              = "Egress from Nagware Lambda function to Redis" -> null
      - from_port                = 6379 -> null
      - id                       = "sgrule-2616193709" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0d34d30a62da57ade" -> null
      - security_group_rule_id   = "sgr-03236e35d5dd47e24" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-092fddfbbac0e15aa" -> null
      - to_port                  = 6379 -> null
      - type                     = "egress" -> null
    }

  # aws_security_group_rule.privatelink_lambda_nagware_ingress will be destroyed
  # (because aws_security_group_rule.privatelink_lambda_nagware_ingress is not in configuration)
  - resource "aws_security_group_rule" "privatelink_lambda_nagware_ingress" {
      - description              = "Security group rule for Nagware Lambda function ingress" -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-3081786021" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-089a83b7d81dff031" -> null
      - security_group_rule_id   = "sgr-0153a9dd124c85569" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0d34d30a62da57ade" -> null
      - to_port                  = 443 -> null
      - type                     = "ingress" -> null
    }

  # aws_security_group_rule.redis_ingress_lambda_nagware will be destroyed
  # (because aws_security_group_rule.redis_ingress_lambda_nagware is not in configuration)
  - resource "aws_security_group_rule" "redis_ingress_lambda_nagware" {
      - description              = "Ingress to Redis from Nagware Lambda function" -> null
      - from_port                = 6379 -> null
      - id                       = "sgrule-1071052535" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-092fddfbbac0e15aa" -> null
      - security_group_rule_id   = "sgr-04dbd7738dc673f02" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0d34d30a62da57ade" -> null
      - to_port                  = 6379 -> null
      - type                     = "ingress" -> null
    }

  # aws_vpc_security_group_egress_rule.privatelink will be created
  + resource "aws_vpc_security_group_egress_rule" "privatelink" {
      + arn                          = (known after apply)
      + from_port                    = 443
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = "sg-089a83b7d81dff031"
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + to_port                      = 443
    }

  # aws_vpc_security_group_ingress_rule.privatelink will be created
  + resource "aws_vpc_security_group_ingress_rule" "privatelink" {
      + arn                          = (known after apply)
      + from_port                    = 443
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = "sg-089a83b7d81dff031"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + to_port                      = 443
    }

  # aws_vpc_security_group_ingress_rule.rds will be created
  + resource "aws_vpc_security_group_ingress_rule" "rds" {
      + arn                          = (known after apply)
      + description                  = "Ingress to database from lambda"
      + from_port                    = 5432
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = "sg-0b80bb714d886b8ff"
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + to_port                      = 5432
    }

  # aws_vpc_security_group_ingress_rule.redis will be created
  + resource "aws_vpc_security_group_ingress_rule" "redis" {
      + arn                          = (known after apply)
      + description                  = "Ingress to Redis from lambda"
      + from_port                    = 6379
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = "sg-092fddfbbac0e15aa"
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + to_port                      = 6379
    }

Plan: 5 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  - lambda_nagware_security_group_id = "sg-0d34d30a62da57ade" -> null
  + lambda_security_group_id         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_default_network_acl.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_security_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_flow_log.vpc_flow_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_internet_gateway.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_public_subnet"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.api_ecs"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.connector_db"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_database"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_egress"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_load_balancer"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_redis"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.idp_db"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.idp_ecs"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.idp_lb"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
